In [1]:
import pandas as pd

In [2]:
s = pd.Series([10, 20, 30])

In [3]:
print(s)

0    10
1    20
2    30
dtype: int64

In [4]:
print(type(s))

<class 'pandas.core.series.Series'>

In [16]:
info = {
    "name":["A", "B", "C", "D"],
    "score":[80, 85, 75, 90]
}

In [17]:
df = pd.DataFrame(info)

In [20]:
df

  name  score
0    A     80
1    B     85
2    C     75
3    D     90

In [24]:
df.loc[0:3:2]

  name  score
0    A     80
2    C     75